---
title: DuctSizes
classe: Autodesk.Revit.DB.Mechanical.DuctSizes
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# DuctSizes

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `ductSizes.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `ductSizes.IsValidObject` | Boolean |
| `Boolean Contains(Double)` | `ductSizes.Contains(nominalDiameter)` | Boolean |
| `Void Dispose()` | `ductSizes.Dispose()` | Void |
| `DuctSizeIterator GetDuctSizeIterator()` | `ductSizes.GetDuctSizeIterator()` | DuctSizeIterator |
| `IEnumerator<MEPSize> GetEnumerator()` | `ductSizes.GetEnumerator()` | IEnumerator<MEPSize> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```